# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\e.ivanov\Documents\GitHub\adc\Manchester encoder-decoder.cydsn\Manchester encoder-decoder.cyprj
# Date: Tue, 15 Sep 2020 06:42:59 GMT
#set_units -time ns
create_clock -name {Clock_2(routed)} -period 27.777777777777775 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_9} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {SPI_ADC_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 37 73} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {SPIM_MEMS_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 37 73} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_5} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]
set_false_path -from [get_pins {__ZERO__/q}]

# Component constraints for C:\Users\e.ivanov\Documents\GitHub\adc\Manchester encoder-decoder.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\e.ivanov\Documents\GitHub\adc\Manchester encoder-decoder.cydsn\Manchester encoder-decoder.cyprj
# Date: Tue, 15 Sep 2020 06:42:43 GMT
